cs306/Vastness.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Vastness</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-07-06 01:26:59 MDT"/>
<meta name="author" content="Brady Field"/>
</head><body>
<h1 class="title">Vastness</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Exploration 3 </h2>
<div id="text-1">


<p>
You are invited to apply what you've learned this semester to
synthesize and analyze algorithms for solving Problem 3 of
Exploration 1 by shrewdly searching through a sentential solution
space, combinatorially explosive, vast in its extent. This
invitation to exploration is codenamed <i>Vastness</i>.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Collaborators Thom - talked about general approaches to the </h3>
<div id="text-1.1">

<p>problem, Matthew - talked about multithreading as a possible
brute force technique, Lance - talked about cool ways to solve the
problem.
</p>

</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1">Introduction </h4>
<div id="text-1.1.1">


<p>
We have been invited to expand upon "Mysteriousness" in further
pursuit of "the question". From the way things have been going,
it appears as though we are going to be able to use some simple
information about the problem to greatly enhance our otherwise
brute force methods. This could help us in the real world since
even relatively simple information can yield big results if
leveraged correctly.
</p>

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Deliverables for Part 1 </h3>
<div id="text-1.2">


<p>
The combination of words
is: "pattern", "numbers", "reason", "random", "appear", "first",
"digit", "that", "look", "just", "the", "ten", "for", "any", "to",
"or", "on", "in", "be", and "a".
</p>
<p>
Lance and I talked about how to elegantly search it. He
brute forced the letter combinations, and then started eliminating
words that had unused letters. We talked about generalizing this
to eliminating words greater than the counts, and then
subtracting the letter totals off of known words to repeat the
process. He was able to greatly leverage this method into
reducing the search space down to a few words. I wanted to do
something similar, but I'm afraid my lack of experience with
Emacs Lisp, and with functional programming in general, pushed me
to go a more simple route. I followed the method briefly
discussed in class where one would search the subspace of the
different word lengths since they were known, and then combine
them into an optimal answer. This worked out fine for me. I wrote
a function to split the list of words into different sub-lists by
length. I then wrote a function to find all the combinations of a
sub-list given a k value to choose between the different words. I
then could compare the combination counts from the server and
take the minimum as a guideline. I then basically had everything
I needed to check a final list against the server and verify that
the chosen combination was correct. The hardest part was
debugging the Elisp. I could spend hours on trivial things such
as debugging loops or if statements. I actually wrote my
combination function in C++ first, and then ported it over to
Elisp once I found a good recursive solution. I'm not sure
how "lispy" it is, but it works. All in all, the exploration was
fun, but it did require a good deal of sweat and tears to get
through the lisp since this is my first real exposure to it.
</p></div>
</div>
</div>
<div id="postamble"><p class="author"> Author: Brady Field
<a href="mailto:emrys@AUS213L30.byui.edu">&lt;emrys@AUS213L30.byui.edu&gt;</a>
</p>
<p class="date"> Date: 2016-07-06 01:26:59 MDT</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
